# vstGetString

## Description
Access string stored in tool's resource file.

```pascal
PROCEDURE vstGetString(
				inStrListID   : INTEGER;
				inStrID       : INTEGER;
				VAR outString : STRING);
```

```python

def vs.vstGetString(inStrListID, inStrID):
    return outString
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrListID|INTEGER||
|inStrID|INTEGER||
|outString|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events